"""
6)	Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных, практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета не обязательно были все типы занятий. Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
Примеры строк файла: Информатика:   100(л)   50(пр)   20(лаб).
                                        Физика:   30(л)   —   10(лаб)
                                        Физкультура:   —   30(пр)   —
Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""
with open('plan.txt', 'r', encoding='utf-8') as file_input:
    dict_plan = {}
    for i in file_input:
        subj, *hours = i.split()
        dict_plan[subj[:-1]] = sum([int(j.split('(')[0]) for j in hours if j.split('(')[0].isdigit()])
    print(dict_plan)
